import streamlit as st

st.title("📺 iQIYI")
st.write("รวมซีรีส์ย้อนยุคสุดฮิตจาก iQIYI ที่ไม่ควรพลาด!")

st.markdown("---")

series_list = [
    {
        "name": "ตำนานรักสวรรค์จันทรา (Moonlight Mystique)",
        "genre": "โรแมนติก / แฟนตาซี / เทพเซียน",
        "description": "ไป๋ซั่ว หญิงสาวที่อยากเป็นเซียนเพื่อตอบแทนบุญคุณ แต่กลับไปพบกับ ฟ่านเยว่ เทพอสูรผู้ยิ่งใหญ่โดยบังเอิญ ทั้งสองคนเริ่มต้นจากความบาดหมาง แต่กลับพัฒนาเป็นความรักที่ต้องเผชิญกับอุปสรรคระหว่างหน้าที่กับหัวใจ ",
        "actors": "อ๋าวรุ่ยเผิง, ไป๋ลู่",
        "image": "https://shorturl.at/IAYog",
        "link": "https://shorturl.at/o1bI5"
    },
    {
        "name": "เคราะห์สวรรค์ทัณฑ์รัก (FEUD)",
        "genre": "โรแมนติก / แฟนตาซี / ดราม่า",
        "description": "หลี่ชิงเยว่ เซียนสาวผู้ทรงพลังที่ตกหลุมรัก ไป๋จิ่วซือ อาจารย์ปรมาจารย์แห่งต้าเฉิง. ความรักของพวกเขาต้องจบลงด้วยโศกนาฏกรรมจากความเข้าใจผิด แต่โชคชะตาให้โอกาสครั้งที่สอง ทั้งคู่จึงกลับมาพบกันอีกครั้ง พร้อมภารกิจปกป้องโลกจากภัยคุกคาม พร้อมกับการตัดสินใจเลือกระหว่างความรักหรือความถูกต้อง",
        "actors": "เจิ้งซุนซี,ไป๋ลู่",
        "image": "https://shorturl.at/aLOwp",
        "link": "https://shorturl.at/fKrEk"
    },
    {
        "name": "สู่ภูผามหาสมุทร (The Journey of Legend)",
        "genre": "ย้อนยุค / ยุทธภพ / ทะลุมิติ ",
        "description": "เรื่องราวของ เซียวหมิงหมิง ชายหนุ่มธรรมดาที่หลงใหลในนิยายกำลังภายใน ได้ทะลุมิติเข้าไปในโลกยุทธภพของนิยายที่เขาแต่งเอง และไปอยู่ในร่างของ เซียวชิวสุ่ย ซึ่งในความจริงกลับเป็นนักกระบี่ฝีมือต่ำต้อย เขาจึงต้องฝึกฝนตัวเองจากศูนย์ ฝ่าฟันอุปสรรคต่างๆ ทั้งจากศัตรู การเมืองในยุทธภพ และบททดสอบหัวใจ เพื่อก้าวไปสู่การเป็นจอมยุทธ์ผู้ยิ่งใหญ่",
        "actors": "เฉิงอี้",
        "image": "https://shorturl.asia/xbXki",
        "link": "https://shorturl.at/PwFO2"
    },
    {
        "name": "หอดอกบัวลายมงคล (Mysterious Lotus Casebook)",
        "genre": "สืบสวน / พีเรียด / มิตรภาพ",
        "description": "หลี่เหลียนฮวา (หรือ หลี่เซี่ยงอี๋ ในอดีต) อดีตปรมาจารย์อันดับหนึ่งแห่งยุทธภพที่ปลอมตัวเป็นหมอพเนจรหลังจากประสบอุบัติเหตุเมื่อ 10 ปีก่อน เขาออกเดินทางด้วยหอดอกบัวเพื่อรักษาชาวบ้าน และได้ร่วมมือกับ ฟางตัวปิ้ง ชายหนุ่มผู้ทะเยอทะยาน และ ตี๋เฟยเซิง อดีตคู่ปรับ เพื่อไขคดีลึกลับต่างๆ ที่เกิดขึ้นในยุทธภพ",
        "actors": "เฉิงอี้, เจิ้งซุ่นซี, เสี่ยวซุ่นเหยา",
        "image": "https://shorturl.asia/l9Vh1",
        "link": "https://shorturl.asia/YOByq"
    },
]

for s in series_list:
    col1, col2 = st.columns([1, 2])
    with col1:
        st.image(s["image"], use_container_width=True)
    with col2:
        st.subheader(s["name"])
        st.markdown(f"**แนว:** {s['genre']}")
        st.markdown(f"**นักแสดงนำ:** {s['actors']}")
        st.write(f"**เรื่องย่อ:** {s['description']}")
        st.markdown(f"[🔗 รับชมบน iQIYI]({s['link']})")
    st.markdown("---")
